CSI API ETABS v1
cFrameObj.GetPoints Method
 Retrieves the names of the point objects at each end of a specified frame object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPoints(
	string Name,
	ref string Point1,
	ref string Point2
)
Function GetPoints (
	Name As String,
	ByRef Point1 As String,
	ByRef Point2 As String
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim Point1 As String
Dim Point2 As String
Dim returnValue As Integer
returnValue = instance.GetPoints(Name,
	Point1, Point2)
int GetPoints(
	String^ Name,
	String^% Point1,
	String^% Point2
)
abstract GetPoints :
        Name : string *
        Point1 : string byref *
        Point2 : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined frame object.
Point1
Type: System.String
 The name of the point object at the I-End of the specified frame object.
Point2
Type: System.String
 The name of the point object at the J-End of the specified frame object.
Return Value
Type: Int32
 Returns zero if the point names are successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Point1 As String
   Dim Point2 As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get names of points
   ret = SapModel.FrameObj.GetPoints("3", Point1, Point2)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace